[
  {
    "name": "Force Dart",
    "ephemCost": 2,
    "damage": "1 per bolt",
    "range": "12\"",
    "description": "Fire 2 bolts of magical energy from your hands that always hit their target so long as they are in range and line of sight. Bolts can be split between targets or all hit the same target. You may spend additional Action Points to fire more bolts, 1 AP for 1 extra bolt.",
    "tier2": "+1 Mana makes all Force Darts deal 2 damage per bolt.",
    "tier3": "+2 Mana makes all Force Darts deal 3 damage per bolt."
  },
  {
    "name": "Fire Spray",
    "ephemCost": 2,
    "damage": "2 (base)",
    "range": "6\" spray template",
    "description": "Spray fire from your fingertips. Place the thin end of the spray template against your Ender’s base in the front arc, pick a target and center the template over their base. The target and all other models under the template take 2 damage and suffer the Burning effect. Starting on your next Upkeep, all Burning models take 1 damage, then Burning ends.",
    "tier2": "+2 Mana: spray becomes 8\" and damage becomes 3; Burning deals 2 damage then expires.",
    "tier3": "+4 Mana: spray becomes 10\" and damage becomes 4; Burning deals 2 damage and lasts 2 rounds, ending at the beginning of your turn."
  },
  {
    "name": "Acid Bath",
    "ephemCost": 2,
    "damage": "3 (base)",
    "range": "Throw (3\" AOE)",
    "description": "Make a Throw action and place a 3\" AOE circle template centered on where the throw lands. All creatures under the template take 3 damage and suffer the Corrosive effect. The AOE remains for 3 turns; any model that enters the AOE suffers the Corrosive effect. Starting on your next Upkeep, any model suffering Corrosive has its Armor Class and Damage permanently reduced by 1. Corrosive lasts 2 rounds.",
    "tier2": "+2 Mana: AOE becomes 4\"; Corrosive reduces Armor Class and Damage by 2 instead.",
    "tier3": "+2 more Mana: AOE becomes 5\" and damage becomes 4; Corrosive still reduces Armor Class and Damage by 2."
  },
  {
    "name": "Frost Bite",
    "ephemCost": 2,
    "damage": "5 (base)",
    "range": "10\"",
    "description": "Target a model within range and line of sight. If hit, it suffers 5 damage. That model and any other models within 1\" of it become Stationary during their next turn and have movement halved the following turn.",
    "tier2": "+1 Mana: range becomes 13\" and damage becomes 6.",
    "tier3": "+1 more Mana: range stays 13\" and damage 6; any other models within 2\" of the hit target become Stationary next turn and have movement halved the following turn."
  },
  {
    "name": "Arc Bolt",
    "ephemCost": 2,
    "damage": "4 (base)",
    "range": "6\"",
    "description": "Make a Cast action targeting a model within range and line of sight. Arc Bolt then jumps to another model of your choice within 3\" of the first, then arcs one more time to a third model within 3\" of that one. Each model hit takes 4 damage. A model cannot be hit more than once by the same casting. Models hit become Stunned for one round.",
    "tier2": "+1 Mana: Arc Bolt jumps one additional time.",
    "tier3": "+2 Mana: Arc Bolt jumps one additional time and damage becomes 5."
  },
  {
    "name": "Chill Lock",
    "ephemCost": 2,
    "damage": "—",
    "range": "8\"",
    "description": "Target up to 3 models within range and line of sight. Targets become Stationary until the beginning of your next turn.",
    "tier2": "+1 Mana: target up to 4 models.",
    "tier3": "+2 Mana: target up to 6 models."
  },
  {
    "name": "Cripple",
    "ephemCost": 2,
    "damage": "—",
    "range": "10\"",
    "description": "Make a Cast action targeting up to 2 models in range and line of sight. Models hit cannot make any attacks for 2 rounds, ending on your turn.",
    "tier2": null,
    "tier3": null
  },
  {
    "name": "Arcane Armor",
    "ephemCost": 2,
    "damage": "—",
    "range": "6\"",
    "description": "Choose a friendly model within range and line of sight. Target gains +2 Armor Class until the spell expires. The effect lasts one round, but you may spend 1 Mana at the beginning of each Player Upkeep to maintain it. You can only have 1 copy of this spell active at a time, and a model cannot have multiple copies from different sources; a new instance replaces the old.",
    "tier2": "+2 Mana: Armor Class bonus becomes +4.",
    "tier3": "+4 Mana: Armor Class +4 and you may have 2 active Arcane Armor effects at a time. You may spend 1 Mana for each active effect in Upkeep to maintain them."
  },
  {
    "name": "Revive",
    "ephemCost": 2,
    "damage": "—",
    "range": "½\" (base contact)",
    "description": "Target a friendly model in base contact that has fallen to 0 HP. That model gains 1 HP and becomes Prone.",
    "tier2": "+2 Mana: HP restored becomes 5.",
    "tier3": "+4 Mana: restore 5 HP and heal 1 Injury."
  },
  {
    "name": "Light Barrier",
    "ephemCost": 2,
    "damage": "—",
    "range": "Self (3\" AOE base)",
    "description": "Summon a barrier of light to protect from ranged attacks. Place a 3\" AOE circle template centered on your base. The barrier blocks any ranged attacks; it has 8 HP and ends if that HP is exceeded or after 1 round.",
    "tier2": "+2 Mana: AOE becomes 4\" and HP becomes 12.",
    "tier3": "+4 Mana: AOE becomes 5\" and HP becomes 18."
  },
  {
    "name": "Hasten",
    "ephemCost": 2,
    "damage": "—",
    "range": "8\"",
    "description": "Choose a friendly model within range and line of sight. That model gains 2 extra Action Points; the spell expires at the end of the Player turn.",
    "tier2": "+1 Mana: target also gains +1 movement speed.",
    "tier3": "+2 Mana: target instead gains +3 movement speed."
  },
  {
    "name": "Smoke Screen",
    "ephemCost": null,
    "damage": "—",
    "range": "TBD",
    "description": "Placeholder – rules for Smoke Screen are not yet fully defined in the current document. Refer to your latest design notes.",
    "tier2": null,
    "tier3": null
  }
]